{
  "total": 500,
  "data": [
    {
      "states": "DC",
      "latLong": "lat:38.916554, long:-77.025977",
      "description": "Over 200,000 African-American soldiers and sailors served in the U.S. Army and Navy during the Civil War. Their service helped to end the war and free over four million slaves. The African American Civil War Memorial honors their service and sacrifice.",
      "designation": "",
      "parkCode": "afam",
      "id": "1A47416F-DAA3-4137-9F30-14AF86B4E547",
      "directionsInfo": "The memorial is located at the corner of Vermont Avenue, 10th St, and U Street NW, near the U Street/African-American Civil War Memorial/Cardozo Metro Station.",
      "directionsUrl": "http://www.nps.gov/afam/planyourvisit/directions.htm",
      "fullName": "African American Civil War Memorial",
      "url": "https://www.nps.gov/afam/index.htm",
      "weatherInfo": "Washington DC gets to see all four seasons. Humidity will make the temps feel hotter in summer and colder in winter.\n\nSpring (March - May) Temp: Average high is 65.5 degrees with a low of 46.5 degrees\n\nSummer (June - August) Temp: Average high is 86 degrees with a low of 68.5 degrees\n\nFall (September - November) Temp: Average high is 68 degrees with a low of 51.5 degrees\n\nWinter (December - February) Temp: Average high is 45 degrees with a low of 30 degrees\n\n(Source: www.usclimatedata.com)",
      "name": "African American Civil War Memorial"
    },
    {
      "states": "GA",
      "latLong": "lat:33.5099067687988, long:-82.0053787231445",
      "description": "The Augusta Canal helped usher the Industrial Revolution into the American South. Built in 1845 as a source of power, water, and transportation, the canal today is the only fully intact American industrial canal in continuous operation. By 1847 the first mills opened, followed by the massive Civil War era Confederate Powder Works and many more industries in the later decades of the 19th century.",
      "designation": "National Heritage Area",
      "parkCode": "auca",
      "id": "813548D1-F8EA-4C07-8878-17FB3C385378",
      "directionsInfo": "To Augusta Canal Discovery Center (1450 Greene Street, Augusta, GA  30901):\nFrom I-20 Exit 200, turn left onto GA-104/Riverwatch Parkway (signs for Downtown Augusta). In approximately 4.5 miles, use the right lane to take the ramp to Downtown Augusta/Medical District. Continue straight onto Greene Street. Continue for approximately 0.4 miles. Enterprise Mill and the Discovery Center will be on your right.",
      "directionsUrl": "http://augustacanal.com/directions.php",
      "fullName": "Augusta Canal National Heritage Area",
      "url": "https://www.nps.gov/auca/index.htm",
      "weatherInfo": "The weather varies throughout the year and even throughout the day. Please check the National Weather Service information at http://www.weather.gov for forecast information.",
      "name": "Augusta Canal"
    },
    {
      "states": "DC",
      "latLong": "lat:38.89231541, long:-77.00381882",
      "description": "Home to the National Woman's Party for nearly 90 years, this was the epicenter of the struggle for women's rights. From this house in the shadow of the U.S. Capitol and Supreme Court, Alice Paul and the NWP developed innovative strategies and tactics to advocate for the Equal Rights Amendment and equality for women. President Barack Obama designated the national monument on April 12, 2016.",
      "designation": "National Monument",
      "parkCode": "bepa",
      "id": "E7E4E103-5FA9-45AC-8843-05DE554CDBB7",
      "directionsInfo": "The Belmont-Paul Women's Equality NM is located on Capitol Hill at the corner of Constitution Avenue and 2nd Street, NE, next to the Hart Senate Office building. It is a free-standing, federal style brick house surrounded by a black cast-iron fence.\nThe entrance for museum tours and the museum shop is located on 2nd Street with the lift accessible entrance located to the side of the museum next to the Hart Senate Office Building. The doors facing Constitution Avenue are not entrances.",
      "directionsUrl": "http://www.nps.gov/bepa/planyourvisit/directions.htm",
      "fullName": "Belmont-Paul Women's Equality National Monument",
      "url": "https://www.nps.gov/bepa/index.htm",
      "weatherInfo": "Washington DC gets to see all four seasons. Humidity will make the temps feel hotter in summer and colder in winter. Spring (March - May) Temp: Average high is 65.5 degrees with a low of 46.5 degrees Summer (June - August) Temp: Average high is 86 degrees with a low of 68.5 degrees Fall (September - November) Temp: Average high is 68 degrees with a low of 51.5 degrees Winter (December - February) Temp: Average high is 45 degrees with a low of 30 degrees (Source: www.usclimatedata.com)",
      "name": "Belmont-Paul Women's Equality"
    },
    {
      "states": "FL",
      "latLong": "lat:25.97079602, long:-81.08120629",
      "description": "The freshwaters of the Big Cypress Swamp, essential to the health of the neighboring Everglades, support the rich marine estuaries along Florida's southwest coast. Protecting over 729,000 acres of this vast swamp, Big Cypress National Preserve contains a mixture of tropical and temperate plant communities that are home to a diversity of wildlife, including the elusive Florida panther.",
      "designation": "National Preserve",
      "parkCode": "bicy",
      "id": "E0F4D5E3-3E4A-4345-B86A-1B0CAD7461F1",
      "directionsInfo": "Big Cypress is located along the Tamiami Trail East and I-75 in southern Florida.  The preserve can be accessed by driving from Miami and Naples. The preserves two visitor centers are located along Tamiami Trail East.",
      "directionsUrl": "http://www.nps.gov/bicy/planyourvisit/directions.htm",
      "fullName": "Big Cypress National Preserve",
      "url": "https://www.nps.gov/bicy/index.htm",
      "weatherInfo": "Big Cypress National Preserve experiences two predominant seasons- wet and dry.\n\nRAINY SEASON\n(May through October)\nWhile visiting during this season you may find daily afternoon thunderstorms, high humidity, temperatures in the mid - to - high 80s and a multitude of mosquitoes. \n\nDRY SEASON\n(November through April)\nFalling water levels within the Big Cypress make this a pleasant time to hike, camp, and watch wildlife.\n\nFor more information visit http://www.nps.gov/bicy/planyourvisit/weather.htm",
      "name": "Big Cypress"
    },
    {
      "states": "UT",
      "latLong": "lat:37.58399144, long:-112.1826689",
      "description": "There is no place like Bryce Canyon. Hoodoos (odd-shaped pillars of rock left standing from the forces of erosion) can be found on every continent, but here is the largest collection of hoodoos in the world! Descriptions fail. Photographs do not do it justice. Bring your sense of wonder and imagination when visiting Bryce Canyon National Park.",
      "designation": "National Park",
      "parkCode": "brca",
      "id": "6B1D053D-714F-46D1-B410-04BE868F14C1",
      "directionsInfo": "From the North:\nTake I-15 south to UT-20 (exit 95). Travel east on UT-20 to US-89. Follow US-89 south to UT-12. Travel east on UT-12 to UT-63. Take UT-63 south to Bryce Canyon National Park.\n\nFrom the South through Zion National Park:\nTake I-15 north to UT-9 (exit 16). Follow UT-9 east through Zion National Park to US-89. Travel north on US-89 to UT-12. Go east on UT-12 to UT-63. Take UT-63 south to Bryce Canyon National Park.",
      "directionsUrl": "http://www.nps.gov/brca/planyourvisit/directions.htm",
      "fullName": "Bryce Canyon National Park",
      "url": "https://www.nps.gov/brca/index.htm",
      "weatherInfo": "http://forecast.weather.gov/MapClick.php?lat=37.63&lon=-112.17#.VpUamdHUhaR",
      "name": "Bryce Canyon"
    },
    {
      "states": "KY",
      "latLong": "",
      "description": "",
      "designation": "National Monument",
      "parkCode": "cane",
      "id": "2FB7A664-0F66-49A3-9460-194F4073BA3F",
      "directionsInfo": "",
      "directionsUrl": "http://www.nps.gov/cane/planyourvisit/directions.htm",
      "fullName": "Camp Nelson National Monument",
      "url": "",
      "weatherInfo": "",
      "name": "Camp Nelson"
    },
    {
      "states": "MA",
      "latLong": "lat:41.92381465, long:-70.04319832",
      "description": "The great Outer Beach described by Thoreau in the 1800s is protected within the national seashore. Forty miles of pristine sandy beach, marshes, ponds, and uplands support diverse species. Lighthouses, cultural landscapes, and wild cranberry bogs offer a glimpse of Cape Cod's past and continuing ways of life. Swimming beaches and walking and biking trails beckon today's visitors.",
      "designation": "National Seashore",
      "parkCode": "caco",
      "id": "DE0A8012-5324-4F5C-98DA-0EE6589FDFB3",
      "directionsInfo": "The national seashore is located in eastern Massachusetts and is accessed via Rt. 6. The park is 20 miles east of Hyannis, MA.",
      "directionsUrl": "http://www.nps.gov/caco/planyourvisit/directions.htm",
      "fullName": "Cape Cod National Seashore",
      "url": "https://www.nps.gov/caco/index.htm",
      "weatherInfo": "Cape Cod's weather is generally moderated by its proximity to the ocean. Winter is typically cold with some snow. Spring is often rainy. Summer is usually warm and humid. Fall is generally dry and clear.",
      "name": "Cape Cod"
    },
    {
      "states": "SC",
      "latLong": "lat:32.84577392, long:-79.82487582",
      "description": "Charles Pinckney was a principal author and a signer of the United States Constitution. This remnant of his coastal plantation is preserved to tell the story of a \"founding father,\" his life of public service, the lives of enslaved African Americans on South Carolina Lowcountry plantations and their influences on Charles Pinckney.",
      "designation": "National Historic Site",
      "parkCode": "chpi",
      "id": "08EFF7E4-0FE4-4402-B23A-124EB8AAC249",
      "directionsInfo": "The park is located on the south side of Long Point Road .7 miles from US Highway 17, or 3 miles if coming from I-526.",
      "directionsUrl": "http://www.nps.gov/chpi/planyourvisit/directions.htm",
      "fullName": "Charles Pinckney National Historic Site",
      "url": "https://www.nps.gov/chpi/index.htm",
      "weatherInfo": "Winters are generally mild. Summers are hot and humid.",
      "name": "Charles Pinckney"
    },
    {
      "states": "OH",
      "latLong": "lat:41.26093905, long:-81.57116722",
      "description": "Though a short distance from the urban areas of Cleveland and Akron, Cuyahoga Valley National Park seems worlds away. The park is a refuge for native plants and wildlife, and provides routes of discovery for visitors. The winding Cuyahoga River gives way to deep forests, rolling hills, and open farmlands. Walk or ride the Towpath Trail to follow the historic route of the Ohio & Erie Canal.",
      "designation": "National Park",
      "parkCode": "cuva",
      "id": "F4D44F29-3F67-498F-B05B-0783473D2708",
      "directionsInfo": "Plane\nCleveland Hopkins International Airport and Akron-Canton Regional Airport offer many daily flights to the area. Car rentals are available at both airports.\n\nBus & Train\nBus stations are located in downtown Cleveland and Akron. The Amtrak station is in downtown Cleveland.\n\nCar\nThe park is easily accessible by car from all directions. A good place to start your visit is at Boston Store Visitor Center located at 1550 Boston Mills Road, Peninsula, Ohio 44264. (81° 33.512' W) (41° 15.803' N).",
      "directionsUrl": "http://www.nps.gov/cuva/planyourvisit/directions.htm",
      "fullName": "Cuyahoga Valley National Park",
      "url": "https://www.nps.gov/cuva/index.htm",
      "weatherInfo": "Spring's rain and warming temperatures bring new leaves on trees, blooming wildflowers, and visitors anxious get out on the trail. \n\nSummer temperatures range from 49 to 95 degrees F and can be humid. Dressing in layers is advisable. \n\nFall temperatures can range from low 70s during the day to freezing during the night. Fall foliage often peaks in mid-October.\n\nWinter weather conditions can rapidly change, due to the lake effect snow from Lake Erie. Temperatures vary from mid-30s to below zero.",
      "name": "Cuyahoga Valley"
    },
    {
      "states": "FL",
      "latLong": "lat:24.64884965, long:-82.87176297",
      "description": "Almost 70 miles (113 km) west of Key West lies the remote Dry Tortugas National Park. This 100-square mile park is mostly open water with seven small islands.  Accessible only by boat or seaplane, the park is known the world over as the home of magnificent Fort Jefferson, picturesque blue waters, superlative coral reefs and marine life, and the vast assortment of bird life that frequents the area.",
      "designation": "National Park",
      "parkCode": "drto",
      "id": "167A05D1-5793-49E0-89FE-0A1DDFA9A7F4",
      "directionsInfo": "Dry Tortugas National Park is one of the most remote parks in the National Park System. Located approximately 70 miles west of Key West it is accessible only by a daily concession ferry, private boats, charter boats, or seaplane.",
      "directionsUrl": "http://www.nps.gov/drto/planyourvisit/directions.htm",
      "fullName": "Dry Tortugas National Park",
      "url": "https://www.nps.gov/drto/index.htm",
      "weatherInfo": "The climate in the Dry Tortugas is subtropical, which basically means that it has warm and tropical weather in the range of 60°F to 90°F. The two main seasons are the winter stormy season from December through March which is windier and sees rougher seas, and the summertime tropical storm season from June through November where there is a higher chance of isolated storms. During the summers it is hot and humid. During the winter the temperature is milder and drier.",
      "name": "Dry Tortugas"
    },
    {
      "states": "IA",
      "latLong": "lat:43.08095081, long:-91.19687517",
      "description": "The mounds preserved here are considered sacred by many Americans, especially the Monument's 20 culturally associated American Indian tribes. A visit offers opportunities to contemplate the meanings of the mounds and the people who built them. The 200 plus American Indian mounds are located in one of the most picturesque sections of the Upper Mississippi River Valley.",
      "designation": "National Monument",
      "parkCode": "efmo",
      "id": "0265E5A4-576A-4626-882A-05971DEE9B76",
      "directionsInfo": "Located 3 miles north of Marquette, Iowa on Hwy 76.",
      "directionsUrl": "http://www.nps.gov/efmo/planyourvisit/directions.htm",
      "fullName": "Effigy Mounds National Monument",
      "url": "https://www.nps.gov/efmo/index.htm",
      "weatherInfo": "All four seasons are represented in this area with summer temperature in the upper 80’s with higher heat indexes due to humidity and winter daytime highs in the 20's. Temperatures are in °Fahrenheit.",
      "name": "Effigy Mounds"
    },
    {
      "states": "NM",
      "latLong": "lat:34.88422799, long:-107.9950948",
      "description": "The richly diverse volcanic landscape of El Malpais offers solitude, recreation, and discovery. Explore cinder cones, lava tube caves, sandstone bluffs, and hiking trails. Wildlife abounds in the open grasslands and forests. While some may see a desolate environment, people have been adapting to and living in this extraordinary terrain for generations. Come discover the land of fire and ice!",
      "designation": "National Monument",
      "parkCode": "elma",
      "id": "0826F21E-43A2-4675-8D2A-11F676293364",
      "directionsInfo": "Take exit 85 of I-40 in Grants, New Mexico. After you exit, head south on Santa Fe Ave, and continue straight over the freeway overpass. Take a left at the entrance sign for El Malpais Visitor Center. Continue 300 yards until you reach the parking lot.",
      "directionsUrl": "http://www.nps.gov/elma/planyourvisit/directions.htm",
      "fullName": "El Malpais National Monument",
      "url": "https://www.nps.gov/elma/index.htm",
      "weatherInfo": "As a general rule, daily temperatures swing roughly 30 degrees (F) from night lows to afternoon highs. Summer is sunny and hot with monsoon rain storms with average high of 80 (F), while Winter is cool, sunny, with potential snow storms and an average high of 45 (F). Spring and Fall are generally dry, with the occasional storm rain and/or snow storm.",
      "name": "El Malpais"
    },
    {
      "states": "OH",
      "latLong": "lat:40.79689857, long:-81.37579869",
      "description": "Two properties, the home of First Lady Ida Saxton McKinley and the seven story 1895 City Bank Building, are preserved at this site, which honors the lives and accomplishment of our nation's First Ladies. The site is managed by the National Park Service and operated by the National First Ladies Library.",
      "designation": "National Historic Site",
      "parkCode": "fila",
      "id": "35CB040E-765C-47D0-A594-05943E64EF3E",
      "directionsInfo": "The First Ladies National Historic Site is located in downtown Canton, Ohio. Free parking is available behind the Saxton House or at our gated lot on the corner of Market Avenue South and 3rd Street SW (entrance from Market Avenue South).",
      "directionsUrl": "http://www.nps.gov/fila/planyourvisit/directions.htm",
      "fullName": "First Ladies National Historic Site",
      "url": "https://www.nps.gov/fila/index.htm",
      "weatherInfo": "The weather at First Ladies National Historic Site is typical of Northeastern Ohio: four distinct seasons. \n\nSpring's rain and warming temperatures bring new leaves on trees and blooming wildflowers.\n\nSummer temperatures range from 49 to 95 degrees F and can be humid. \n\nFall temperatures can range from low 70s during the day to freezing during the night. Fallcolor peaks mid-October.\n\nWinter weather conditions can rapidly change. Temperatures vary from mid-30s to below zero.",
      "name": "First Ladies"
    },
    {
      "states": "AZ",
      "latLong": "lat:32.14925942, long:-109.451132",
      "description": "Fort Bowie witnessed almost 25 years of conflict between the Chiricahua Apache and the US Army, and remains a tangible connection to the turbulent era of the late 1800s. Explore the history of Fort Bowie and Apache Pass as you hike the 1.5 mile trail to the visitor center and old fort ruins. Today, this peaceful landscape stands in stark contrast to the violence that once gripped this land.",
      "designation": "National Historic Site",
      "parkCode": "fobo",
      "id": "5AD68231-8681-43F6-89B1-08E5AA4C7FE6",
      "directionsInfo": "From Willcox, AZ / points west on I-10: drive 23 miles east of Willcox on Interstate 10 to the the town of Bowie. Exit at the first Bowie exit and drive through the town. Follow the signs for Fort Bowie National Historic Site and turn south on Apache Pass Road. Drive 13 miles to the Fort Bowie Trailhead (the last mile of the road is unpaved). Be prepared to walk the three miles round trip to the ruins and back to your car.",
      "directionsUrl": "http://www.nps.gov/fobo/planyourvisit/directions.htm",
      "fullName": "Fort Bowie National Historic Site",
      "url": "https://www.nps.gov/fobo/index.htm",
      "weatherInfo": "Please check the Fort Bowie weather page for up to date weather conditions: http://www.wunderground.com/personal-weather-station/dashboard?ID=MAU921",
      "name": "Fort Bowie"
    },
    {
      "states": "TX",
      "latLong": "lat:30.59930381, long:-103.8961904",
      "description": "Fort Davis is one of the best surviving examples of an Indian Wars' frontier military post in the Southwest. From 1854 to 1891, Fort Davis was strategically located to protect emigrants, mail coaches, and freight wagons on the Trans-Pecos portion of the San Antonio-El Paso Road and on the Chihuahua Trail.",
      "designation": "National Historic Site",
      "parkCode": "foda",
      "id": "DE70B987-01A4-4BA5-9662-030BE3329AB3",
      "directionsInfo": "We are approximately 2.5 hours south of Midland/Odessa starting on I-20 to HWY 17, 3.5 hours North West of Del Rio starting on HWY 90 to HWY 118, 4 hours east of El Paso starting on I-10 to HWY 118 and 7 hours west of San Antonio starting on I-10 to HWY 17.",
      "directionsUrl": "http://www.nps.gov/foda/planyourvisit/directions.htm",
      "fullName": "Fort Davis National Historic Site",
      "url": "https://www.nps.gov/foda/index.htm",
      "weatherInfo": "Summer Temperatures average a High of 95 and low of 65. Winter Temperatures average a High of 60 and a low of 20.  Wind is very common and heavy rainfall is very sporadic.",
      "name": "Fort Davis"
    },
    {
      "states": "NY",
      "latLong": "lat:43.21053441, long:-75.45557626",
      "description": "For centuries, the Oneida Carrying Place, a six mile portage connecting the Mohawk River and Wood Creek, served as a vital link for those traveling by water from the ocean to the Great Lakes. When Europeans arrived, nations fought for control of the carry, the homelands of the Six Nations Confederacy, and the rich resources of North America. In this struggle, Fort Stanwix would play a vital role.",
      "designation": "National Monument",
      "parkCode": "fost",
      "id": "D57C8F0D-71E9-46D7-B00B-001BC7E39096",
      "directionsInfo": "Take I-90 (NY Thruway) to Exit 33 (Verona-Rome). Turn Right onto Rt. 365 E. Follow Rt. 365, veering left as Rt. 365 merges with Rt 69 at the fork in the road. This will take you over an arterial bridge into the City of Rome. Fort Stanwix NM will be across Erie Blvd. on the right side of James Street.",
      "directionsUrl": "http://www.nps.gov/fost/planyourvisit/directions.htm",
      "fullName": "Fort Stanwix National Monument",
      "url": "https://www.nps.gov/fost/index.htm",
      "weatherInfo": "The Park lies within a temperate zone and experiences four full seasons. Summer can become very hot and humid. Snow is common as late as May and as early as October. The fort area can become muddy in all seasons. With most activities outdoors, good closed-toe walking shoes and low heels are advised. Air conditioning and heating is limited to park visitor center most times in the year. Water and extra layers of clothing in all seasons are always recommended!",
      "name": "Fort Stanwix"
    },
    {
      "states": "DC",
      "latLong": "lat:38.86298458, long:-76.98508147",
      "description": "Frederick Douglass spent his life fighting for justice and equality. Born into slavery in 1818, he escaped as a young man and became a leading voice in the abolitionist movement. People everywhere still find inspiration today in his tireless struggle, brilliant words, and inclusive vision of humanity. Douglass's legacy is preserved here at Cedar Hill, where he lived his last 17 years.",
      "designation": "National Historic Site",
      "parkCode": "frdo",
      "id": "F6831504-A456-45C8-B87B-0FCE1D849A12",
      "directionsInfo": "The site can be reached by car, public transportation, or on foot. See the directions page of the website for more detailed information.",
      "directionsUrl": "http://www.nps.gov/frdo/planyourvisit/directions.htm",
      "fullName": "Frederick Douglass National Historic Site",
      "url": "https://www.nps.gov/frdo/index.htm",
      "weatherInfo": "Winter: Temperatures usually range from 30 to 50 F. There is occasional snow.\n\nSpring: Temperatures usually range widely from 40 to 70 F. Rain is common.\n\nSummer: Temperatures usually range from 70 to 90 F. Humidity is usually high. Be prepared and drink plenty of water. There is a water fountain in the visitor center.\n\nFall: Temperatures usually range widely from 40 to 70 F. Humidity can remain high in the earlier part of the season.",
      "name": "Frederick Douglass"
    },
    {
      "states": "VA",
      "latLong": "lat:38.28277118, long:-77.6470428",
      "description": "Fredericksburg, Chancellorsville, Wilderness, and Spotsylvania--this is America's battleground, where the Civil War roared to its bloody climax. No place more vividly reflects the War's tragic cost in all its forms. A town bombarded and looted. Farms large and small ruined. Refugees by the thousands forced into the countryside. More than 85,000 men wounded; 15,000 killed--most in graves unknown.",
      "designation": "National Military Park",
      "parkCode": "frsp",
      "id": "52430E36-3361-4BB8-BE6F-0F2834E50CB3",
      "directionsInfo": "Our park has an immense number of sites to explore! Challenge your ideas about a battle at one of our visitor centers or exhibit shelters, or peer into the past by walking through one of our historic structures.\n\nFor directions and physical addresses for each of our sites, please visit the Directions & Transportation section of our website.",
      "directionsUrl": "http://www.nps.gov/frsp/planyourvisit/directions.htm",
      "fullName": "Fredericksburg & Spotsylvania National Military Park",
      "url": "https://www.nps.gov/frsp/index.htm",
      "weatherInfo": "The regional climate is characterized by mild winters and warm, humid summers. The mean annual temperatures is 56 degrees Fahrenheit. The average summer temperature is 75 degrees Fahrenheit. Daytime highs during the summer are in the upper 80s, and nighttime lows are in the lower 60s. Daytime highs in the winter are in the upper 40s, and nighttime lows are in the middle 20s. Precipitation is well distributed throughout the year, with the minimum amount in August and the maximum in February.",
      "name": "Fredericksburg & Spotsylvania"
    },
    {
      "states": "PA",
      "latLong": "lat:39.77543423, long:-79.92504169",
      "description": "Albert Gallatin is best remembered for his thirteen year tenure as Secretary of the Treasury during the Jefferson and Madison administrations. In that time he reduced the national debt, purchased the Louisiana Territory and funded the Lewis & Clark exploration. Gallatin's accomplishments and contributions are highlighted at Friendship Hill, his restored country estate.",
      "designation": "National Historic Site",
      "parkCode": "frhi",
      "id": "F6D0ABED-2C07-4194-8CB7-09476271EDB9",
      "directionsInfo": "Friendship Hill NHS is located on PA 166 three miles north of Point Marion, Pennsylvania.",
      "directionsUrl": "http://www.nps.gov/frhi/planyourvisit/directions.htm",
      "fullName": "Friendship Hill National Historic Site",
      "url": "https://www.nps.gov/frhi/index.htm",
      "weatherInfo": "Weather varies considerably within each season.  Be prepared with layered clothing. Precipitation is common throughout the year.\nSpring: Temperatures usually range from 25°F to 70°F.  On average, May is the wettest month.\nSummer: Temperatures usually range from 50°F to 80°F. July is the warmest month.\nFall: Temperatures usually range from 30°F to 70°F. Fall foliage is at its peak around mid-October. \nWinter: Temperatures range from 15°F to 40°F.  January is the coldest month.",
      "name": "Friendship Hill"
    },
    {
      "states": "AK",
      "latLong": "lat:67.75961636, long:-153.2917758",
      "description": "This vast landscape does not contain any roads or trails. Visitors discover intact ecosystems where people have lived with the land for thousands of years. Wild rivers meander through glacier-carved valleys, caribou migrate along age-old trails, endless summer light fades into aurora-lit night skies of winter. It remains virtually unchanged except by the forces of nature.",
      "designation": "National Park & Preserve",
      "parkCode": "gaar",
      "id": "BC195D18-71C8-4A99-BF8E-10BFAB849679",
      "directionsInfo": "Gates of the Arctic is a wilderness park, with no roads or trails into the park lands, so visitors must fly or hike into the park. Access begins in Fairbanks, Alaska & there are several small airlines that provide daily flights into the communities of Bettles and Anaktuvuk Pass, and Coldfoot. Most visitors access the park by air taxi or hike in from the Dalton Highway or from the village of Anaktuvuk Pass. River crossings are necessary from both locations.",
      "directionsUrl": "http://www.nps.gov/gaar/planyourvisit/directions.htm",
      "fullName": "Gates Of The Arctic National Park & Preserve",
      "url": "https://www.nps.gov/gaar/index.htm",
      "weatherInfo": "The climate of Gates of the Arctic National Park & Preserve is generally classified as arctic and sub-arctic, with exceptionally cold winters, relatively mild summers, low annual precipitation, and generally high winds. The weather is influenced by many different systems, and can change rapidly.",
      "name": "Gates Of The Arctic"
    },
    {
      "states": "WV",
      "latLong": "lat:38.20614947, long:-81.00420836",
      "description": "The 25 miles of free-flowing Gauley River and the six miles of the Meadow River pass through scenic gorges and valleys containing a wide variety of natural and cultural features. The Gauley River contains several class V+ rapids, making it one of the most adventurous white water boating rivers in the east.",
      "designation": "National Recreation Area",
      "parkCode": "gari",
      "id": "A1994071-1BCB-4C14-9C21-108348882067",
      "directionsInfo": "Plane\nThe largest airport is at Charleston, about 65 miles from Summersville. There are also small airports at Summersville and Beckley.\n\nCar\nThe main entrance to Gauley River National Recreation Area is located off US Route 19 south of Summersville and north of Fayetteville, West Virginia. Turn off US Route 19 onto WV Route 129 toward Summersville Dam. Take the second left after you cross over the dam and follow the signs to Gauley River.",
      "directionsUrl": "http:www.gari/planyourvisit/directions.htm",
      "fullName": "Gauley River National Recreation Area",
      "url": "https://www.nps.gov/gari/index.htm",
      "weatherInfo": "Weather in the Appalachian Mountains can be unpredictable and can change quickly. Always be prepared for the possibility of sudden storms. Weather in the mountains is often cooler and wetter than the surrounding area. On average, the warmest month is July. The maximum average precipitation also occurs in July.",
      "name": "Gauley River"
    },
    {
      "states": "MD",
      "latLong": "lat:38.96912315, long:-77.14012206",
      "description": "Glen Echo Park began in 1891 as a National Chautauqua Assembly \"to promote liberal and practical education.\" By 1911, it transformed into DC's premier amusement park until it closed in 1968. Since 1971, the National Park Service has owned and operated the site and today, with the help of the Glen Echo Park Partnership for Arts and Culture, offers year-round cultural and recreational activities.",
      "designation": "Park",
      "parkCode": "glec",
      "id": "3FBC6D2D-C61B-4399-BC35-1B00C92C406A",
      "directionsInfo": "By Car: Capital Beltway (I-495), Maryland outer loop exit 40 Cabin John Parkway to Clara Barton Parkway; Virginia inner loop exit 41 Clara Barton Parkway East; follow Clara Barton Parkway to MacArthur Boulevard and Glen Echo exit, left onto MacArthur Boulevard, straight across traffic circle at Goldsboro Road, next left onto Oxford Road, end of street, parking lots on the left.\n\nBy Metro: Red Line to Bethesda or Friendship Heights Station, transfer to Montgomery County Ride-On Bus # 29, Glen Echo stop.",
      "directionsUrl": "http://www.nps.gov/glec/planyourvisit/directions.htm",
      "fullName": "Glen Echo Park",
      "url": "https://www.nps.gov/glec/index.htm",
      "weatherInfo": "Weather for Washington, D.C. and Bethesda, Maryland areas.",
      "name": "Glen Echo"
    },
    {
      "states": "CA",
      "latLong": "lat:37.85982543, long:-122.6007386",
      "description": "Experience a park so rich it supports 19 distinct ecosystems with over 2,000 plant and animal species. Go for a hike, enjoy a vista, have a picnic or learn about the centuries of overlapping history from California’s indigenous cultures, Spanish colonialism, the Mexican Republic, US military expansion and the growth of San Francisco. All of this and more awaits you, so get out and find your park.",
      "designation": "National Recreation Area",
      "parkCode": "goga",
      "id": "0E797FA8-6E31-418B-A68F-13CEE37A2AF5",
      "directionsInfo": "Golden Gate National Recreation Area has many sites that span over 60 miles of mostly coastal areas north and south of San Francisco. Park areas can be reached by Highways 1, 101 and 280 from the north and south San Francisco Bay Area, and by Highway 80 from the East Bay. \n\nTo access park headquarters at Fort Mason, please use the entrance at Franklin and Bay Streets in San Francisco.",
      "directionsUrl": "http://www.nps.gov/goga/planyourvisit/directions.htm",
      "fullName": "Golden Gate National Recreation Area",
      "url": "https://www.nps.gov/goga/index.htm",
      "weatherInfo": "Winter is characterized by sporadic rain and cool weather punctuated by brilliant sunshine. In winter the grass greens. Trees and flowers dormant through winter start blooming in late February or early March and last until May or June. By July, summer fog predominates in most coastal areas of the park. Grasses and plants have now turned to the golden brown and muted grays characteristic of California summer and fall.  September and October skies are clear and sunshine is abundant everywhere in the park.",
      "name": "Golden Gate"
    },
    {
      "states": "NY",
      "latLong": "lat:40.69164233, long:-74.01670765",
      "description": "From 1794 to 1966, the U.S. Army on Governors Island was part of the social, political, and economic tapestry of New York City. Today, the island is a vibrant summer seasonal venue of art, culture, and performance against the backdrop of two centuries of military heritage and the skyline of one of the great cities of the world. The island is currently open to the public through October 31, 2018.",
      "designation": "National Monument",
      "parkCode": "gois",
      "id": "F7DA09B4-41C4-4372-9EBB-15AD1526B391",
      "directionsInfo": "Governors Island is located in New York Harbor, 1/2 mile from the southern tip of Lower Manhattan and 400 yards west of the end of Brooklyn's Atlantic Avenue and Red Hook waterfront. It is accessible only via ferry. Ferry service from Manhattan is the main way to access the island. During the summer public access season, the ferry departs from Battery Maritime Building at 10 South Street, at South and Whitehall Streets (next to the Staten Island ferry terminal). Check www.govisland.com for ferry schedules.",
      "directionsUrl": "https://nps.gov/gois/planyourvisit/directions.htm",
      "fullName": "Governors Island National Monument",
      "url": "https://www.nps.gov/gois/index.htm",
      "weatherInfo": "During the summer public access season from May to September, the weather is typical of the mid-Atlantic region. Thunderstorms can come quickly with short downpours. There may be extended periods of heat or humidity that might last a week or more. The island is generally a few degrees cooler than the city due to the fairly constant breeze.",
      "name": "Governors Island"
    },
    {
      "states": "NY",
      "latLong": "lat:42.9128920286894, long:-76.5646715462208",
      "description": "Harriet Tubman was guided by a deep faith and devotion to family, freedom, and community. After emancipating herself and members of her family, she moved them from Ontario, Canada to Fleming and Auburn, New York in 1859. Central New York was a center for progressive thought, abolition, and women’s suffrage where Tubman continued to fight for human rights and dignity until she died in 1913.",
      "designation": "National Historical Park",
      "parkCode": "hart",
      "id": "067468EC-25DB-447C-91A8-068C167EEF32",
      "directionsInfo": "The Harriet Tubman National Historical Park includes the Thompson Memorial African Methodist Episcopal Zion Church, the Harriet Tubman Visitor Center, the Tubman Home for the Aged, and the Harriet Tubman Residence. A related Tubman site that lies outside of the national historical park is the Fort Hill Cemetery where Tubman is buried. \n\nView directions to each of these five sites on our directions page.",
      "directionsUrl": "http://www.nps.gov/hart/planyourvisit/directions.htm",
      "fullName": "Harriet Tubman National Historical Park",
      "url": "https://www.nps.gov/hart/index.htm",
      "weatherInfo": "Auburn, New York has four distinct seasons. Fall and spring are usually mild and summers tend to be sunny, warm, and humid. Winter weather is variable and conditions can change quickly. Snow in November is not uncommon. The heaviest snowfall tends to be in January with an average of 33”.",
      "name": "Harriet Tubman"
    },
    {
      "states": "VA",
      "latLong": "lat:37.20027185, long:-76.75469561",
      "description": "Walk in the steps of Captain John Smith and Pocahontas where a successful English colonization of North America began.  Despite early struggles to survive, the 1607 settlement evolved into a prosperous colony.  As the colony expanded, the Virginia Indians were pushed out of their homeland.  In 1619, the arrival of Africans was recorded, marking the origin of slavery in English North America.",
      "designation": "Part of Colonial National Historical Park",
      "parkCode": "jame",
      "id": "9CFF594A-8DB1-4377-BE2A-10CC2B0C47E1",
      "directionsInfo": "Situated on the banks of the James River, Jamestown is a short distance from many major roadways and highways. For a google map search or GPS, use the following address: 1368 Colonial Parkway, Jamestown, Virginia 23081.",
      "directionsUrl": "http://www.nps.gov/jame/planyourvisit/directions.htm",
      "fullName": "Historic Jamestowne Part of Colonial National Historical Park",
      "url": "https://www.nps.gov/jame/index.htm",
      "weatherInfo": "http://www.nps.gov/jame/planyourvisit/weather.htm\n\nNUMBER TO PHONE IF SITES ARE CLOSED DUE TO INCLEMENT WEATHER:\n For closures in Colonial National Historical Park please phone this 24 hour phone number (757) 856-1240.",
      "name": "Historic Jamestowne"
    },
    {
      "states": "AZ",
      "latLong": "lat:33.18713877, long:-111.9192737",
      "description": "The \"Monument\" is located on the Gila River Indian Reservation and is under tribal ownership. The Gila River Indian Community has decided not to open the extremely sensitive area to the public. There is no park brochure, passport stamp, picture stamp or other free literature available.",
      "designation": "National Monument",
      "parkCode": "pima",
      "id": "7F402367-BA37-4B9B-85BD-05A7679CD449",
      "directionsInfo": "Please do not attempt to visit this area. The park was not established beyond an administrative action. There is nothing to see and it is trespassing to wander Gila River Indian Community lands.",
      "directionsUrl": "http://www.nps.gov/cagr/contacts.htm",
      "fullName": "Hohokam Pima National Monument",
      "url": "https://www.nps.gov/pima/index.htm",
      "weatherInfo": "Park is not open to the public. Desert landscape, with all its usual inhabitants, is not friendly to trespassers.",
      "name": "Hohokam Pima"
    },
    {
      "states": "AK",
      "latLong": "lat:59.81804414, long:-150.106502",
      "description": "At the edge of the Kenai Peninsula lies a land where the ice age lingers. Nearly 40 glaciers flow from the Harding Icefield, Kenai Fjords' crowning feature. Wildlife thrives in icy waters and lush forests around this vast expanse of ice. Sugpiaq people relied on these resources to nurture a life entwined with the sea. Today, shrinking glaciers bear witness to the effects of our changing climate.",
      "designation": "National Park",
      "parkCode": "kefj",
      "id": "11E73438-0CCC-4441-A76A-1995F67F2D89",
      "directionsInfo": "Kenai Fjords National Park is located just outside the town of Seward in south-central Alaska, 126 miles south of Anchorage. Even though the park is often inaccessible during the winter months, Seward is accessible year-round via the Seward Highway, a National Scenic Byway.\n\nFollow the Seward Highway (AK-1) south from Anchorage. It will become AK-9 around mile 35 (87 miles from Anchorage) with AK-1 heading to Homer and Kenai. Continue on AK-9 to Seward.",
      "directionsUrl": "http://www.nps.gov/kefj/planyourvisit/directions.htm",
      "fullName": "Kenai Fjords National Park",
      "url": "https://www.nps.gov/kefj/index.htm",
      "weatherInfo": "The weather  Kenai Fjords is difficult to predict and can change rapidly. The area generally enjoys a relatively temperate maritime climate, primarily due to the influence of the Japanese current that flows through the Gulf of Alaska.\n\nSummer daytime temperatures range from the mid 40s to the low 70s (Fahrenheit). Overcast and cool rainy days are frequent. Winter temperatures can range from the low 30s to -20.",
      "name": "Kenai Fjords"
    },
    {
      "states": "ND",
      "latLong": "lat:47.3540219, long:-101.3860533",
      "description": "Earthlodge people hunted bison and other game, but were in essence farmers living in villages along the Missouri and its tributaries. The site was a major Native American trade center for hundreds of years prior to becoming an important market place for fur traders after 1750.",
      "designation": "National Historic Site",
      "parkCode": "knri",
      "id": "0103833B-8114-4483-9754-11B5171BCB20",
      "directionsInfo": "Plane\nFly into Bismarck or Minot, ND. Hazen, ND (15 miles from site) has an airport for small planes.\n\nCar\nOne-half mile north of Stanton, ND on County Road 37. One hour northwest of Bismarck, ND and one and a half hours southwest of Minot, ND.\n\nPublic Transportation\nCharter and tour bus parking available at Visitor Center parking lot.",
      "directionsUrl": "http://www.nps.gov/knri/planyourvisit/directions.htm",
      "fullName": "Knife River Indian Villages National Historic Site",
      "url": "https://www.nps.gov/knri/index.htm",
      "weatherInfo": "Summers are warm and sunny with temperatures occasionally reaching 100 degrees F and frequent afternoon thunderstorms.  Winters are invigorating, with extremely cold temperatures as low as -35 degrees F.  High winds and sunny skies are common in winter.  Snow is sporadic in the relatively dry climate, but blizzards are common.",
      "name": "Knife River Indian Villages"
    },
    {
      "states": "DC",
      "latLong": "lat:38.88784226, long:-77.04773857",
      "description": "Our nation honors her sons and daughters who answered the call to defend a country they never knew and a people they never met.",
      "designation": "",
      "parkCode": "kowa",
      "id": "0DEA542F-01B7-4631-8AAD-124161D7B7E6",
      "directionsInfo": "GPS Coordinates: 38.887778, -77.047660\nAddress: 10 Daniel French Dr, SW, Washington, D.C.\nNearest Intersection: Independence Ave. & Daniel Chester French Dr. SW",
      "directionsUrl": "http://www.nps.gov/kowa/planyourvisit/directions.htm",
      "fullName": "Korean War Veterans Memorial",
      "url": "https://www.nps.gov/kowa/index.htm",
      "weatherInfo": "Washington DC gets to see all four seasons. Humidity will make the temps feel hotter in summer and colder in winter.\n\nSpring (March - May) Temp: Average high is 65.5 degrees with a low of 46.5 degrees\n\nSummer (June - August) Temp: Average high is 86 degrees with a low of 68.5 degrees\n\nFall (September - November) Temp: Average high is 68 degrees with a low of 51.5 degrees\n\nWinter (December - February) Temp: Average high is 45 degrees with a low of 30 degrees\n\n(Source: www.usclimatedata.com)",
      "name": "Korean War Veterans Memorial"
    },
    {
      "states": "DC",
      "latLong": "lat:38.88927229, long:-77.05017778",
      "description": "\"In this temple, as in the hearts of the people for whom he saved the Union, the memory of Abraham Lincoln is enshrined forever.\" Beneath these words, the 16th President of the United States sits immortalized in marble as an enduring symbol of unity, strength, and wisdom.",
      "designation": "",
      "parkCode": "linc",
      "id": "1EAEF5FA-8CD4-40D7-8B09-07F20E3E5AA5",
      "directionsInfo": "GPS Coordinates: 38.889321, -77.050166\nAddress: 2 Lincoln Memorial Circle, NW, Washington, D.C.\nNearest Intersection: Independence Ave. SW & Daniel Chester French Dr. SW",
      "directionsUrl": "http://www.nps.gov/linc/planyourvisit/directions.htm",
      "fullName": "Lincoln Memorial",
      "url": "https://www.nps.gov/linc/index.htm",
      "weatherInfo": "Washington DC gets to see all four seasons. Humidity will make the temps feel hotter in summer and colder in winter.\n\nSpring (March - May) Temp: Average high is 65.5 degrees with a low of 46.5 degrees\n\nSummer (June - August) Temp: Average high is 86 degrees with a low of 68.5 degrees\n\nFall (September - November) Temp: Average high is 68 degrees with a low of 51.5 degrees\n\nWinter (December - February) Temp: Average high is 45 degrees with a low of 30 degrees\n\n(Source: www.usclimatedata.com)",
      "name": "Lincoln Memorial"
    },
    {
      "states": "AR",
      "latLong": "lat:34.7369465, long:-92.29987899",
      "description": "Little Rock Central High School is recognized for the role it played in the desegregation of public schools in the United States.  The nine African-American students' persistence in attending the formerly all-white Central High School was the most prominent national example of the implementation of the May 17, 1954 Supreme Court decision Brown v. Board of Education.",
      "designation": "National Historic Site",
      "parkCode": "chsc",
      "id": "5C51E54A-BCDA-4186-96C3-1B896C3CDFCB",
      "directionsInfo": "From I 630 take Exit 2 B, Dr. Martin Luther King Dr. south (away from the State Capitol) to Daisy L. Gatson Bates Drive.  Turn right (west).  Drive .5 miles.  The National Historic Site Visitor Center is on the right at the corner of Daisy L. Gatson Bates Drive and Park street.  Parking lot entrance is located just before the intersection with Park Street, directly across from the historic Magnolia Gas Station and diagonally across from Central High, which is still an operating school.",
      "directionsUrl": "http://www.nps.gov/chsc/planyourvisit/directions.htm",
      "fullName": "Little Rock Central High School National Historic Site",
      "url": "https://www.nps.gov/chsc/index.htm",
      "weatherInfo": "Arkansas Weather can change quickly.  While the state is in a moderate temperate zone, it does experience strong thunderstorms, tornadoes and flash floods.  In winter, \"Snow\" events tend to quickly turn to thin ice which can be difficult to see and to clear.  Summer temperatures and humidity can lead to dehydration, heat exhaustion and heat stroke.  Visitors are advised to dress in layers and be prepared for precipitation.",
      "name": "Little Rock Central High School"
    },
    {
      "states": "MA",
      "latLong": "lat:42.37698854, long:-71.12636956",
      "description": "Longfellow House - Washington's Headquarters National Historic Site preserves the home of Henry W. Longfellow, one of the world’s foremost 19th century poets. The house also served as headquarters for General George Washington during the Siege of Boston, July 1775 - April 1776. In addition to its rich history, the site offers unique opportunities to explore 19th century literature and arts.",
      "designation": "National Historic Site",
      "parkCode": "long",
      "id": "CE9470A1-A8D7-49DE-A555-1A32FBBAB0FF",
      "directionsInfo": "Longfellow House-Washington's Headquarters NHS is located in a residential section of Cambridge, MA. There is very little public parking in the area and onsite parking is limited to vehicles with handicapped parking permits. However, the site is a short walk from Harvard Square, where there are paid parking lots and a station for the MBTA Red Line and numerous bus routes. The use of public transportation to the site is highly recommended. Follow the link for detailed instructions.",
      "directionsUrl": "http://www.nps.gov/long/planyourvisit/directions.htm",
      "fullName": "Longfellow House Washington's Headquarters National Historic Site",
      "url": "https://www.nps.gov/long/index.htm",
      "weatherInfo": "New England weather is highly variable. Temperatures in the winter can be very cold with high snowfall. Fall and spring are generally pleasant. Summer temperatures are generally mild, with short periods of heat and humidity. However, the house is air conditioned and heated for collection care and the comfort of the visitor.",
      "name": "Longfellow House Washington's Headquarters"
    },
    {
      "states": "CA",
      "latLong": "lat:36.72559195, long:-118.1547177",
      "description": "In 1942, the United States government ordered more than 110,000 men, women, and children to leave their homes and detained them in remote, military-style camps. Manzanar War Relocation Center was one of ten camps where Japanese American citizens and resident Japanese aliens were incarcerated during World War II.",
      "designation": "National Historic Site",
      "parkCode": "manz",
      "id": "249AF67F-BB6C-4D0A-B632-07BEE855D24B",
      "directionsInfo": "Manzanar is located on the west side of U.S. Highway 395, 9 miles north of Lone Pine, California and 6 miles south of Independence, CA.",
      "directionsUrl": "http://home.nps.gov/manz/planyourvisit/directions.htm",
      "fullName": "Manzanar National Historic Site",
      "url": "https://www.nps.gov/manz/index.htm",
      "weatherInfo": "Manzanar is located in the Owens Valley at 4,000' elevation, at the eastern base of the Sierra Nevada. We get little precipitation but we do have four distinct seasons. Summer temperatures can soar over 100 degrees. Winter highs are usually in the 40's. Nighttime temperatures year round are 30 to 40 degrees less than daytime highs. High winds are common in any season.",
      "name": "Manzanar"
    },
    {
      "states": "NY",
      "latLong": "lat:42.36819596, long:-73.70834257",
      "description": "Politics before the Civil War was a whirlwind of opposing interest groups. Martin Van Buren was able to unite those groups becoming president in 1837. As frustration and violence over the extension of slavery grew in the 1840's, Van Buren ran for the presidency twice more from this house. He hoped to unite sectional interests but failed; ultimately so did the union.",
      "designation": "National Historic Site",
      "parkCode": "mava",
      "id": "C1713EAF-0437-4CE1-8CFB-04147E1318F3",
      "directionsInfo": "The park entrance road is located off of route 9H  two miles south of Kinderhook Village.  \n\nGPS Coordinates:  42° 22' 52'' N   -73° 42' 13'' W",
      "directionsUrl": "http://www.nps.gov/mava/planyourvisit/directions.htm",
      "fullName": "Martin Van Buren National Historic Site",
      "url": "https://www.nps.gov/mava/index.htm",
      "weatherInfo": "The weather at Martin Van Buren National Historic Site is typical of the northeast United States; it varies considerably throughout the year. Always check the forecast prior to your visit and dress accordingly. Be sure to wear comfortable walking shoes as well.",
      "name": "Martin Van Buren"
    },
    {
      "states": "MI",
      "latLong": "lat:42.518180847168, long:-83.8187713623047",
      "description": "If you are interested in automotive history, then MotorCities National Heritage Area is the place to be. Tour the factory where Henry Ford created and built the Model T. Learn the stories behind the creation of General Motors and DamilerChrysler. Come with us and learn about the long and sometimes tenuous relationship between Labor and Industry while experiencing southeast Michigan.",
      "designation": "National Heritage Area",
      "parkCode": "auto",
      "id": "0A1E13CA-F967-42FE-8334-128EB369A4EA",
      "directionsInfo": "The MotorCities National Heritage Area encompasses over 10,000 square miles in southeast and central Michigan. The Partnership's administrative headquarters are in Detroit.",
      "directionsUrl": "http://www.motorcities.org/Explore+MotorCities.html",
      "fullName": "Motor Cities National Heritage Area",
      "url": "https://www.nps.gov/auto/index.htm",
      "weatherInfo": "Michigan has a temperate climate with well-defined seasons. The warmest temperatures and longest frost-free period are found most generally in the southern part of the lower peninsula; Detroit has a normal daily mean temperature of 49°F (9°C), ranging from 23°F (–5°C) in January to 72°F (22°C) in July.",
      "name": "Motor Cities"
    },
    {
      "states": "OH",
      "latLong": "lat:39.9818229675293, long:-84.0711364746094",
      "description": "Aviation is chock-full of tradition & history and nowhere will you find a richer collection of aviation than here, the birthplace of aviation.  From the straightforward bicycle shops that fostered the Wright brothers' flying ambitions to the complex spacecraft that carried man to the moon, the National Aviation Heritage Area has everything you need to learn about this country’s aviation legacy.",
      "designation": "Heritage Area",
      "parkCode": "avia",
      "id": "C8C207D8-49C4-4891-9915-0007205A0284",
      "directionsInfo": "The National Aviation Heritage Area has multiple sites located throughout eight counties in the Dayton, Ohio and western Ohio area. Please be sure to visit a specific National Aviation Heritage Area website for directions and/or maps to each location.",
      "directionsUrl": "http://www.aviationheritagearea.org/",
      "fullName": "National Aviation Heritage Area",
      "url": "https://www.nps.gov/avia/index.htm",
      "weatherInfo": "The National Aviation Heritage Area lies in a humid continental zone with a generally temperate climate. Winters are mildly cold with average temperatures around 39 degrees (F). Summers are hot and humid with an average temperature around 74 degrees (F). Average annual total rainfall is just above 41\". Snowfall in the winter is generally light with an average total snowfall of about 25\".",
      "name": "National Aviation"
    },
    {
      "states": "DC",
      "latLong": "lat:38.85301412, long:-76.98495791",
      "description": "Welcome to National Capital Parks-East. We invite you to journey to parks Beyond the Capital of Washington, D.C.  National Capital Parks-East is 13 park sites, parkways and statuary covering more than 8,000 acres of historic, cultural, and recreational parklands from Capitol Hill to the nearby Maryland suburbs",
      "designation": "",
      "parkCode": "nace",
      "id": "BA3C1A1D-AA6A-49EB-9237-0222CEEE2670",
      "directionsInfo": "DC295 South to the Exit for I-694/I-395/Capitol Hill then a left Exit 4B to 11th St SE/MLK Jr Ave.  Turn Left at light onto 11st/MLK JR. **\n\nI-295 North to Exit 4B to 11th St SE/MLK Jr Ave.  Turn Right at the light.  **\n\nFrom downtown DC: I-395 to I-695/SW Freeway, take Exit 1C 11th St SE. Turn Right onto 11th St **\n\n** At the  light turn Right onto Good Hope Road.  At the Stop Sign turn Left.  Turn Left at the next road way.",
      "directionsUrl": "http://www.nps.gov/nace/planyourvisit/directions.htm",
      "fullName": "National Capital Parks-East",
      "url": "https://www.nps.gov/nace/index.htm",
      "weatherInfo": "Summers are generally hot and humid, with daytime highs frequently above 90 degrees Fahrenheit, high humidity, and scattered afternoon thunderstorms. \nWinters are generally cold, with nighttime lows frequently near freezing and occasional snowfall. \nWeather during spring and fall is generally moderate, but can change quickly.",
      "name": "National Capital Parks-East"
    },
    {
      "states": "NE",
      "latLong": "lat:42.79413083, long:-99.91870646",
      "description": "The 76 miles of the Niobrara National Scenic River winds through dramatic bluffs, incredible wildlife diversity, gorgeous waterfalls, world-class fossil resources, and plenty of floating fun for the whole family. Less than 1/4 of one percent of US rivers are designated under the National Wild & Scenic Rivers System. Come discover why this prairie river has earned this honor.",
      "designation": "National Scenic River",
      "parkCode": "niob",
      "id": "406594CB-1532-45CD-82EA-0C03FD2F0422",
      "directionsInfo": "Most visitors start their trip in the city of Valentine, Nebraska. Valentine is 76 miles south of I-90 (Murdo, SD Exit) on Hwy 83; or 130 miles north of I-80 (North Platte, NE Exit) on Hwy 83.\n\nThe nearest major airports are in Rapid City, SD (220 miles); Denver, CO (391 miles); and Omaha, NE (300 miles).",
      "directionsUrl": "http://www.nps.gov/niob/planyourvisit/directions.htm",
      "fullName": "Niobrara National Scenic River",
      "url": "https://www.nps.gov/niob/index.htm",
      "weatherInfo": "Summer (June-August): highs - low 80s to low 100s; lows - 50s to 60s, with occasional thunderstorms and associated strong winds. Moderate dry winds are common in the summer. 8.3\" is average summer rainfall.\n\nSpring (April/May) and Fall (September/October) have cooler temperatures: average highs 60-70s, average lows 30-40s with 7.3\" average rain/snowfall.",
      "name": "Niobrara"
    },
    {
      "states": "AZ",
      "latLong": "lat:32.03585543, long:-112.8573314",
      "description": "Look closely. Look again. The sights and sounds of Organ Pipe Cactus National Monument, an International Biosphere Reserve, reveal a thriving community of plants and animals. Human stories echo throughout this desert preserve, chronicling thousands of years of desert living. A scenic drive, wilderness hike or a night of camping will expose you to a living desert that thrives.",
      "designation": "National Monument",
      "parkCode": "orpi",
      "id": "8A4FA0D4-A3BE-4AE2-8303-1936D9BA1E29",
      "directionsInfo": "The Kris Eggle Visitor Center is located on Highway 85, approximately 25 miles south of Why, AZ.",
      "directionsUrl": "http://www.nps.gov/orpi/planyourvisit/directions.htm",
      "fullName": "Organ Pipe Cactus National Monument",
      "url": "https://www.nps.gov/orpi/index.htm",
      "weatherInfo": "Summer months are hot, with temperatures exceeding 100F.  Winter months are milder, with temperatures in the 70s, with overnight lows in the 40s.",
      "name": "Organ Pipe Cactus"
    },
    {
      "states": "MO",
      "latLong": "lat:37.13968894, long:-91.25709817",
      "description": "Ozark National Scenic Riverways is the first national park area to protect a river system. The Current and Jacks Fork Rivers are two of the finest floating rivers you'll find anywhere. Spring-fed, cold and clear they are a delight to canoe, swim, boat or fish. Besides these two famous rivers, the park is home to hundreds of freshwater springs, caves, trails and historic sites such as Alley Mill.",
      "designation": "National Scenic Riverways",
      "parkCode": "ozar",
      "id": "CEC2A157-CDDC-4F11-BBE5-0AA2CEA35ADB",
      "directionsInfo": "The Headquarters for Ozark National Scenic Riverways is located at 404 Watercress Drive in Van Buren, Missouri.  It's located at the corner of Watercress Drive and Main Street, across the street from the Van Buren Public School complex.",
      "directionsUrl": "http://www.nps.gov/ozar/planyourvisit/directions.htm",
      "fullName": "Ozark National Scenic Riverways",
      "url": "https://www.nps.gov/ozar/index.htm",
      "weatherInfo": "Ozark National Scenic Riverways is located in southeastern Missouri.  Summer temperatures generally range from 75-100 degrees with high humidity.  Winter temperatures generally range from 0-50 degrees with periods of intermittent freezing and snow.",
      "name": "Ozark"
    },
    {
      "states": "AZ",
      "latLong": "lat:36.41535465, long:-113.6682797",
      "description": "Take a lonely and rocky two-track road in a 4x4 to the edge of the Grand Wash Cliffs. Find a stunning solitary vista deep into the Grand Canyon. Relax in the shade of ponderosas at Mt. Trumbull. Touch ancient waters at Pakoon Springs in one of the driest places in the world. Parashant is remote. There are no crowds here. Be equipped to leave pavement, cell service, and the 21st century behind.",
      "designation": "Grand Canyon-Parashant National Monument",
      "parkCode": "para",
      "id": "F614E6C5-1283-431A-AF44-15FC849D65FE",
      "directionsInfo": "The monument is located in the northwest corner of Arizona, bordering Nevada to the west and near the southern border of Utah. There are no paved roads or visitor services within the monuments million-plus acres. Visitors should be prepared for travel on rugged dirt roads. Traveling with an appropriate high clearance vehicle equipped with 8-ply or 10-ply tires or with two full-sized spare tires is recommended. The monument has entry roads from Nevada, Utah and Arizona.",
      "directionsUrl": "http://home.nps.gov/para/planyourvisit/directions.htm",
      "fullName": "Parashant Grand Canyon-Parashant National Monument",
      "url": "https://www.nps.gov/para/index.htm",
      "weatherInfo": "Parashant's  climate is a subtropical, hot desert climate, typical of the Mojave Desert in which it lies. The region enjoys abundant sunshine year-round; it has an average of about 310 sunny days per year. It is virtually free of tornadoes and ice storms. The summer months of June through September are very hot and mostly dry, with a July daily average temperature of 92.5 °F (33.6 °C), while night time temperatures often remain above 80 °F. There are an average of 134 days of 90 °F + highs.",
      "name": "Parashant"
    },
    {
      "states": "VA",
      "latLong": "lat:37.19109957, long:-77.47594865",
      "description": "Nine and a half months, 70,000 casualties, the suffering of civilians, thousands of U. S. Colored Troops fighting for the freedom of their race, and the decline of Gen. Robert E. Lee's Army of No. Virginia all describe the Siege of Petersburg. It was here Gen. Ulysses S. Grant cut off all of Petersburg's supply lines ensuring the fall of Richmond on April 3, 1865. Six days later, Lee surrendered.",
      "designation": "National Battlefield",
      "parkCode": "pete",
      "id": "16B99840-35CB-4D14-BB83-136C371EFD2E",
      "directionsInfo": "The Eastern Front (Main) Visitor Center is located approximately 2.5 miles east of Rt. 95 off of Route 36 in Petersburg. If travelling north on Rt. 95, take exit 50D and follow signs to Wythe Street. Once on Wythe Street, travel 2.5 miles east to entrance of Battlefield. If travelling south on Rt. 95, take Exit 52 (Wythe Street). Again, travel about 2.5 miles to entrance.",
      "directionsUrl": "http://www.nps.gov/pete/planyourvisit/directions.htm",
      "fullName": "Petersburg National Battlefield",
      "url": "https://www.nps.gov/pete/index.htm",
      "weatherInfo": "Winters are usually cool with temperatures averaging in the 40s. \nSpring and fall are mild.\nSummer can bring very hot and humid weather.",
      "name": "Petersburg"
    },
    {
      "states": "NY",
      "latLong": "lat:40.88579128, long:-73.49686438",
      "description": "Sagamore Hill was the home of Theodore Roosevelt, 26th President of the United States, from 1885 until his death in 1919. During Roosevelt's time in office, his \"Summer White House\" was the focus of international attention. Explore the natural surroundings and become inspired by the legacy of one of America's most popular presidents.",
      "designation": "National Historic Site",
      "parkCode": "sahi",
      "id": "BA5A0D58-E05F-44AE-94F1-10A88A4AF143",
      "directionsInfo": "Take either the Northern State Parkway to Exit 35N or the Long Island Expressway (I-495) to Exit 41N. At those exits, take Route 106 North for approximately 6 miles to downtown Oyster Bay. Turn right onto East Main Street (at Nobman's Hardware Store) and travel 2 miles on East Main Street/Cove Road. Turn left onto Cove Neck Road and drive 1.5 miles to Sagamore Hill National Historic Site.",
      "directionsUrl": "http://www.nps.gov/sahi/planyourvisit/directions.htm",
      "fullName": "Sagamore Hill National Historic Site",
      "url": "https://www.nps.gov/sahi/index.htm",
      "weatherInfo": "The Atlantic Ocean and Long Island Sound moderates the climate of Long Island and Sagamore Hill.\n\nSpring: Highs average between 50 F and 70 F. Snow in early March becomes rain by April.\nSummer: Average highs range between 70 F and the upper 80s F. Summers are drier but thunderstorms are possible.\nFall: Highs are from the mid-50s F to the mid-70s F. Fall is the driest season, but showers are possible.\nWinter: Highs are around 40 F. Snow showers are common; the largest accumulations come in February.",
      "name": "Sagamore Hill"
    },
    {
      "states": "WI,MN",
      "latLong": "lat:45.70019235, long:-92.36126685",
      "description": "Grab your paddle and your longing for adventure and head to the St. Croix and Namekagon rivers! Together they form the St. Croix National Scenic Riverway, offering over 200 miles of clean water that glides and rushes through a forested landscape. Paddle, boat, fish, and camp among this wild and scenic beauty. Hiking and historic towns also beckon, if you can bear to leave the cool water.",
      "designation": "National Scenic Riverway",
      "parkCode": "sacn",
      "id": "5CB26B91-B888-46E0-95E1-0683A63C45B0",
      "directionsInfo": "The St. Croix National Scenic Riverway stretches for over 200 miles in northwest Wisconsin and east-central Minnesota. The Namekagon River flows entirely in Wisconsin while the St. Croix River serves as a border between the two states for much of its length. With many different access points there are numerous opportunities for day trips as well as multi-day paddling adventures. Visitor centers are located on the Namekagon River in Trego, Wisconsin, and on the St. Croix River in St. Croix Falls, Wisconsin.",
      "directionsUrl": "http://www.nps.gov/sacn/planyourvisit/directions.htm",
      "fullName": "Saint Croix National Scenic Riverway",
      "url": "https://www.nps.gov/sacn/index.htm",
      "weatherInfo": "Access to the Riverway is year-round. Early spring temperatures can reach into the 40's resulting in high, fast, and cold water from melting snow and ice. Summers are warm and humid. Severe weather can be experienced anytime from mid-spring through late summer. Fall colors begin in late September with high temperatures averaging in the 60's. Winter can set in early with high temperatures in the teens, lows falling below zero, and occasional heavy snow. The rivers can begin to freeze over by early December.",
      "name": "Saint Croix"
    },
    {
      "states": "NM",
      "latLong": "lat:34.35423203, long:-106.2050309",
      "description": "Tucked away in the middle of New Mexico you’ll find Salinas Pueblo Missions National Monument. The three sites offer a glimpse into a unique time in history. A time entrenched with cultural borrowing, conflict, and struggles. The now abandoned sites stand as reminders of the Spanish and Pueblo People’s early encounters.",
      "designation": "National Monument",
      "parkCode": "sapu",
      "id": "4E7F8D4B-68EC-4A1B-BB71-0A295EB08557",
      "directionsInfo": "Reach the Mountainair Headquarters by taking I-25 south from Albuquerque to Belen, then NM 47 diagonally to US 60, then east 21 miles to Mountainair. To travel the historic highway route (Turquoise Highway) from the north, take I-40 east from Albuquerque to NM 337, drive south 47 miles (76K) to junction with NM State Highway 55. Proceed right (west) on Hwy 55 about 16 miles (26 K). Turn right on Highway 60 and proceed one block to HQ.  Information on the ruins & surrounding area is available here.",
      "directionsUrl": "http://www.nps.gov/sapu/planyourvisit/directions.htm",
      "fullName": "Salinas Pueblo Missions National Monument",
      "url": "https://www.nps.gov/sapu/index.htm",
      "weatherInfo": "Salinas Pueblo Missions is at 6100-6500 ft (1860-1980 m) in an arid climate. Average annual rainfall is about 15 inches. \n\nWinters can be cold & snowy. Summer highs are above 90F/32C with cool evenings. \n\nJune-September often has thunderstorms. Flash flooding may occur in the area. Abo Ruins is especially prone to road closures as a result. \n\nSpring highs average 75F/24C & Fall a little cooler. \n\nHigh winds often occur. Trails may be closed during these times. Check local weather prior to visiting.",
      "name": "Salinas Pueblo Missions"
    },
    {
      "states": "VI",
      "latLong": "lat:17.77908602, long:-64.75519348",
      "description": "Salt River Bay National Historical Park and Ecological Preserve uniquely documents the human and natural Caribbean world from the earliest indigenous settlements in the central Caribbean to their clash with seven different colonial European powers to the present day.",
      "designation": "National Historical Park and Ecological Preserve",
      "parkCode": "sari",
      "id": "E84CCC52-A22F-42D6-86F1-198D818C25DD",
      "directionsInfo": "There are several air carriers to St Croix arriving at the Henry E. Rohlesen Airport. The park is five miles from Christiansted National Historic Site and can be reached by car via Rt. 75 from Christiansted, connecting to Route 80. Cars may be rented at the airport and various other island locations. Ask your lodging hosts for information about guided land tours.",
      "directionsUrl": "http://www.nps.gov/sari/planyourvisit/directions.htm",
      "fullName": "Salt River Bay National Historical Park and Ecological Preserve",
      "url": "https://www.nps.gov/sari/index.htm",
      "weatherInfo": "Welcome to the tropics!",
      "name": "Salt River Bay"
    },
    {
      "states": "TX",
      "latLong": "lat:29.31262089, long:-98.4289522",
      "description": "After 10,000 years, the people of South Texas found their cultures, their very lives under attack. In the early 1700s Apache raided from the north, deadly diseases traveled from Mexico, and drought lingered. Survival lay in the missions. By entering a mission, they foreswore their traditional life to become Spanish, accepting a new religion and pledging fealty to a distant and unseen king.",
      "designation": "National Historical Park",
      "parkCode": "saan",
      "id": "CCE1AD17-9B13-4D74-9CAC-0278D5477316",
      "directionsInfo": "Park Headquarter's is located 4 miles south of downtown San Antonio.\nThe four mission sites lay as a chain south of downtown. Mission Concepción is 3 miles, Mission San José and the park visitor center is 6 miles south, Mission San Juan is 3 miles south of San José, and Mission Espada lays another mile beyond. \nWritten directions and GPS addresses can be found at the link below.",
      "directionsUrl": "http://www.nps.gov/saan/planyourvisit/directions.htm",
      "fullName": "San Antonio Missions National Historical Park",
      "url": "https://www.nps.gov/saan/index.htm",
      "weatherInfo": "Over the course of a year, the temperature typically varies from 40°F to 95°F and is rarely below 29°F or above 100°F. The warm season lasts from May through September with an average daily high temperature above 90°F and a low of 75°F. The cold season lasts from November through February with an average daily high below 68°F and an average low of 40°F.\nThe relative humidity ranges from 40-80% over the course of the year, which can be very uncomfortable to many people.",
      "name": "San Antonio Missions"
    },
    {
      "states": "ND",
      "latLong": "lat:47.17777274, long:-103.4300083",
      "description": "When Theodore Roosevelt came to Dakota Territory to hunt bison in 1883, he was a skinny, young, spectacled dude from New York. He could not have imagined how his adventure in this remote and unfamiliar place would forever alter the course of the nation. The rugged landscape and strenuous life that TR experienced here would help shape a conservation policy that we still benefit from today.",
      "designation": "National Park",
      "parkCode": "thro",
      "id": "B5FE5682-7981-47DD-AC96-13F4B33A466E",
      "directionsInfo": "Theodore Roosevelt National Park is located in the Badlands of western North Dakota. \nThere are three units to the park. The South Unit entrance is in the town of Medora, ND off of Interstate 94 exits 24 and 27. The North Unit entrance is on Highway 85 approximately 14 miles south of Watford City, ND. The remote Elkhorn Ranch Unit sits roughly in the middle of the North and South Units and is accessed via gravel roads. Consult park staff for directions to the Elkhorn Ranch Unit.",
      "directionsUrl": "http://www.nps.gov/thro/planyourvisit/directions.htm",
      "fullName": "Theodore Roosevelt National Park",
      "url": "https://www.nps.gov/thro/index.htm",
      "weatherInfo": "In winter, some or all park roads may be closed due to snow.",
      "name": "Theodore Roosevelt"
    },
    {
      "states": "DC",
      "latLong": "lat:38.88101431, long:-77.03632572",
      "description": "Author of the Declaration of Independence, statesman and visionary for the founding of a nation.",
      "designation": "",
      "parkCode": "thje",
      "id": "2D0C31DF-BE78-42A8-812E-1A44602B3D40",
      "directionsInfo": "GPS Coordinates: 38.881387, -77.036508\n\nThomas Jefferson Memorial is part of the National Mall and Memorial Parks. The site lies at the southern end of the National Mall, adjacent to the Tidal Basin in West Potomac Park. The memorial rests within the sightline to and from the White House, which stands one mile to the north.",
      "directionsUrl": "http://www.nps.gov/thje/planyourvisit/directions.htm",
      "fullName": "Thomas Jefferson Memorial",
      "url": "https://www.nps.gov/thje/index.htm",
      "weatherInfo": "Washington DC gets to see all four seasons. Humidity will make the temps feel hotter in summer and colder in winter.\n\nSpring (March - May) Temp: Average high is 65.5 degrees with a low of 46.5 degrees\n\nSummer (June - August) Temp: Average high is 86 degrees with a low of 68.5 degrees\n\nFall (September - November) Temp: Average high is 68 degrees with a low of 51.5 degrees\n\nWinter (December - February) Temp: Average high is 45 degrees with a low of 30 degrees\n\n(Source: www.usclimatedata.com)",
      "name": "Thomas Jefferson Memorial"
    },
    {
      "states": "VA",
      "latLong": "lat:37.38623205, long:-76.29900672",
      "description": "Discover what it took for the United States to be independent as you explore the site of the last major battle of the Revolutionary War.  Here at Yorktown, in the fall of 1781, General George Washington, with allied American and French forces, besieged General Charles Lord Cornwallis’s British army.  On October 19, Cornwallis surrendered, effectively ending the war and ensuring independence.",
      "designation": "Part of Colonial National Historical Park",
      "parkCode": "york",
      "id": "D09FF0F8-B16E-4D2B-9C37-03202D6B8176",
      "directionsInfo": "For an internet map search or GPS, use the following:\nYorktown Battlefield Visitor Center, 1000 Colonial Parkway, Yorktown, Virginia 23690.\n\nEastbound from the Richmond area via I-64, exit 242B for Yorktown, to the Colonial Parkway. Follow the parkway to its end. West bound Interstate 64 from the Virginia Beach/Norfolk/Hampton area for Yorktown should take Route 105 East (Fort Eustis Boulevard east), exit 250B to Route 17. Turn left  onto Route 17. Follow the signs to Yorktown Battlefield.",
      "directionsUrl": "http://www.nps.gov/york/planyourvisit/directions.htm",
      "fullName": "Yorktown Battlefield Part of Colonial National Historical Park",
      "url": "https://www.nps.gov/york/index.htm",
      "weatherInfo": "Yorktown, VA climate is warm during summer when temperatures tend to be in the 80's and cold during winter when temperatures tend to be in the 30's.\n\nThe warmest month of the year is July with an average maximum temperature of 89.00 degrees Fahrenheit, while the coldest month of the year is January with an average minimum temperature of 28.10 degrees Fahrenheit.    \n\nFor closures in due to inclement weather at Colonial National Historical Park please phone this 24 hour phone number (757) 856-1240.",
      "name": "Yorktown Battlefield"
    }
  ],
  "limit": 50,
  "start": 1
}